; domain
(define (domain parking)
 (:requirements :strips :typing)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

	(:action move-curb-to-curb
		:parameters (?o1 - car ?o2 ?o3 - curb)
		:precondition (and 
			(car-clear ?o1)
			(curb-clear ?o3)
			(at-curb-num ?o1 ?o2)
		)
		:effect (and 
			(not (curb-clear ?o3))
			(curb-clear ?o2)
			(at-curb-num ?o1 ?o3)
			(not (at-curb-num ?o1 ?o2))
		)
	)

	(:action move-curb-to-car
		:parameters (?o1 - car ?o2 - curb ?o3 - car)
		:precondition (and 
			(car-clear ?o1)
			(car-clear ?o3)
			(at-curb-num ?o1 ?o2)
			(at-curb ?o3) 
		)
		:effect (and 
			(not (car-clear ?o3))
			(curb-clear ?o2)
			(behind-car ?o1 ?o3)
			(not (at-curb-num ?o1 ?o2))
			(not (at-curb ?o1))
		)
	)

	(:action move-car-to-curb
		:parameters (?o1 - car ?o2 - car ?o3 - curb)
		:precondition (and 
			(car-clear ?o1)
			(curb-clear ?o3)
			(behind-car ?o1 ?o2)
		)
		:effect (and 
			(not (curb-clear ?o3))
			(car-clear ?o2)
			(at-curb-num ?o1 ?o3)
			(not (behind-car ?o1 ?o2))
			(at-curb ?o1)
		)
	)

	(:action move-car-to-car
		:parameters (?o1 ?o2 ?o3 - car)
		:precondition (and 
			(car-clear ?o1)
			(car-clear ?o3)
			(behind-car ?o1 ?o2)
			(at-curb ?o3) 
		)
		:effect (and 
			(not (car-clear ?o3))
			(car-clear ?o2)
			(behind-car ?o1 ?o3)
			(not (behind-car ?o1 ?o2))
		)
	)
)

; problem
(define (problem parking)
  (:domain parking)
  (:objects car_00 -  car car_01 -  car car_03 -  car car_04 -  car car_02 -  car car_06 -  car car_05 -  car car_07 -  car car_08 -  car car_09 -  car car_10 -  car car_11 -  car curb_0 -  curb curb_1 -  curb curb_2 -  curb curb_3 -  curb curb_4 -  curb curb_5 -  curb curb_6 -  curb )
  (:init (car-clear car_09) (at-curb car_08) (at-curb-num car_08 curb_4) (car-clear car_11) (car-clear car_10) (at-curb-num car_00 curb_0) (at-curb car_00) (at-curb-num car_05 curb_5) (at-curb car_05) (at-curb-num car_01 curb_1) (at-curb car_01) (car-clear car_07) (at-curb-num car_02 curb_2) (at-curb car_02) (at-curb-num car_06 curb_6) (at-curb car_06) (car-clear car_04) (behind-car car_04 car_01) (at-curb-num car_03 curb_3) (at-curb car_03) (behind-car car_09 car_02) (car-clear car_06) (behind-car car_07 car_00) (behind-car car_11 car_08) (car-clear car_05) (behind-car car_10 car_03) )
  (:goal (and (car-clear car_09)(car-clear car_11)(car-clear car_10)(at-curb-num car_00 curb_0)(at-curb car_00)(at-curb-num car_05 curb_5)(at-curb car_05)(at-curb-num car_01 curb_1)(at-curb car_01)(car-clear car_07)(at-curb-num car_02 curb_2)(at-curb car_02)(at-curb-num car_06 curb_6)(at-curb car_06)(at-curb-num car_03 curb_3)(at-curb car_03)(behind-car car_09 car_02)(behind-car car_07 car_00)(behind-car car_10 car_03)(car-clear car_08)(at-curb-num car_04 curb_4)(at-curb car_04)(car-clear car_05)(behind-car car_08 car_01)(car-clear car_06)(behind-car car_11 car_04)(not (at-curb car_07))(not (at-curb car_08))(not (at-curb car_09))(not (at-curb car_10))(not (at-curb car_11))(not (at-curb-num car_00 curb_1))(not (at-curb-num car_00 curb_2))(not (at-curb-num car_00 curb_3))(not (at-curb-num car_00 curb_4))(not (at-curb-num car_00 curb_5))(not (at-curb-num car_00 curb_6))(not (at-curb-num car_01 curb_0))(not (at-curb-num car_01 curb_2))(not (at-curb-num car_01 curb_3))(not (at-curb-num car_01 curb_4))(not (at-curb-num car_01 curb_5))(not (at-curb-num car_01 curb_6))(not (at-curb-num car_02 curb_0))(not (at-curb-num car_02 curb_1))(not (at-curb-num car_02 curb_3))(not (at-curb-num car_02 curb_4))(not (at-curb-num car_02 curb_5))(not (at-curb-num car_02 curb_6))(not (at-curb-num car_03 curb_0))(not (at-curb-num car_03 curb_1))(not (at-curb-num car_03 curb_2))(not (at-curb-num car_03 curb_4))(not (at-curb-num car_03 curb_5))(not (at-curb-num car_03 curb_6))(not (at-curb-num car_04 curb_0))(not (at-curb-num car_04 curb_1))(not (at-curb-num car_04 curb_2))(not (at-curb-num car_04 curb_3))(not (at-curb-num car_04 curb_5))(not (at-curb-num car_04 curb_6))(not (at-curb-num car_05 curb_0))(not (at-curb-num car_05 curb_1))(not (at-curb-num car_05 curb_2))(not (at-curb-num car_05 curb_3))(not (at-curb-num car_05 curb_4))(not (at-curb-num car_05 curb_6))(not (at-curb-num car_06 curb_0))(not (at-curb-num car_06 curb_1))(not (at-curb-num car_06 curb_2))(not (at-curb-num car_06 curb_3))(not (at-curb-num car_06 curb_4))(not (at-curb-num car_06 curb_5))(not (at-curb-num car_07 curb_0))(not (at-curb-num car_07 curb_1))(not (at-curb-num car_07 curb_2))(not (at-curb-num car_07 curb_3))(not (at-curb-num car_07 curb_4))(not (at-curb-num car_07 curb_5))(not (at-curb-num car_07 curb_6))(not (at-curb-num car_08 curb_0))(not (at-curb-num car_08 curb_1))(not (at-curb-num car_08 curb_2))(not (at-curb-num car_08 curb_3))(not (at-curb-num car_08 curb_4))(not (at-curb-num car_08 curb_5))(not (at-curb-num car_08 curb_6))(not (at-curb-num car_09 curb_0))(not (at-curb-num car_09 curb_1))(not (at-curb-num car_09 curb_2))(not (at-curb-num car_09 curb_3))(not (at-curb-num car_09 curb_4))(not (at-curb-num car_09 curb_5))(not (at-curb-num car_09 curb_6))(not (at-curb-num car_10 curb_0))(not (at-curb-num car_10 curb_1))(not (at-curb-num car_10 curb_2))(not (at-curb-num car_10 curb_3))(not (at-curb-num car_10 curb_4))(not (at-curb-num car_10 curb_5))(not (at-curb-num car_10 curb_6))(not (at-curb-num car_11 curb_0))(not (at-curb-num car_11 curb_1))(not (at-curb-num car_11 curb_2))(not (at-curb-num car_11 curb_3))(not (at-curb-num car_11 curb_4))(not (at-curb-num car_11 curb_5))(not (at-curb-num car_11 curb_6))(not (behind-car car_00 car_00))(not (behind-car car_00 car_01))(not (behind-car car_00 car_02))(not (behind-car car_00 car_03))(not (behind-car car_00 car_04))(not (behind-car car_00 car_05))(not (behind-car car_00 car_06))(not (behind-car car_00 car_07))(not (behind-car car_00 car_08))(not (behind-car car_00 car_09))(not (behind-car car_00 car_10))(not (behind-car car_00 car_11))(not (behind-car car_01 car_00))(not (behind-car car_01 car_01))(not (behind-car car_01 car_02))(not (behind-car car_01 car_03))(not (behind-car car_01 car_04))(not (behind-car car_01 car_05))(not (behind-car car_01 car_06))(not (behind-car car_01 car_07))(not (behind-car car_01 car_08))(not (behind-car car_01 car_09))(not (behind-car car_01 car_10))(not (behind-car car_01 car_11))(not (behind-car car_02 car_00))(not (behind-car car_02 car_01))(not (behind-car car_02 car_02))(not (behind-car car_02 car_03))(not (behind-car car_02 car_04))(not (behind-car car_02 car_05))(not (behind-car car_02 car_06))(not (behind-car car_02 car_07))(not (behind-car car_02 car_08))(not (behind-car car_02 car_09))(not (behind-car car_02 car_10))(not (behind-car car_02 car_11))(not (behind-car car_03 car_00))(not (behind-car car_03 car_01))(not (behind-car car_03 car_02))(not (behind-car car_03 car_03))(not (behind-car car_03 car_04))(not (behind-car car_03 car_05))(not (behind-car car_03 car_06))(not (behind-car car_03 car_07))(not (behind-car car_03 car_08))(not (behind-car car_03 car_09))(not (behind-car car_03 car_10))(not (behind-car car_03 car_11))(not (behind-car car_04 car_00))(not (behind-car car_04 car_01))(not (behind-car car_04 car_02))(not (behind-car car_04 car_03))(not (behind-car car_04 car_04))(not (behind-car car_04 car_05))(not (behind-car car_04 car_06))(not (behind-car car_04 car_07))(not (behind-car car_04 car_08))(not (behind-car car_04 car_09))(not (behind-car car_04 car_10))(not (behind-car car_04 car_11))(not (behind-car car_05 car_00))(not (behind-car car_05 car_01))(not (behind-car car_05 car_02))(not (behind-car car_05 car_03))(not (behind-car car_05 car_04))(not (behind-car car_05 car_05))(not (behind-car car_05 car_06))(not (behind-car car_05 car_07))(not (behind-car car_05 car_08))(not (behind-car car_05 car_09))(not (behind-car car_05 car_10))(not (behind-car car_05 car_11))(not (behind-car car_06 car_00))(not (behind-car car_06 car_01))(not (behind-car car_06 car_02))(not (behind-car car_06 car_03))(not (behind-car car_06 car_04))(not (behind-car car_06 car_05))(not (behind-car car_06 car_06))(not (behind-car car_06 car_07))(not (behind-car car_06 car_08))(not (behind-car car_06 car_09))(not (behind-car car_06 car_10))(not (behind-car car_06 car_11))(not (behind-car car_07 car_01))(not (behind-car car_07 car_02))(not (behind-car car_07 car_03))(not (behind-car car_07 car_04))(not (behind-car car_07 car_05))(not (behind-car car_07 car_06))(not (behind-car car_07 car_07))(not (behind-car car_07 car_08))(not (behind-car car_07 car_09))(not (behind-car car_07 car_10))(not (behind-car car_07 car_11))(not (behind-car car_08 car_00))(not (behind-car car_08 car_02))(not (behind-car car_08 car_03))(not (behind-car car_08 car_04))(not (behind-car car_08 car_05))(not (behind-car car_08 car_06))(not (behind-car car_08 car_07))(not (behind-car car_08 car_08))(not (behind-car car_08 car_09))(not (behind-car car_08 car_10))(not (behind-car car_08 car_11))(not (behind-car car_09 car_00))(not (behind-car car_09 car_01))(not (behind-car car_09 car_03))(not (behind-car car_09 car_04))(not (behind-car car_09 car_05))(not (behind-car car_09 car_06))(not (behind-car car_09 car_07))(not (behind-car car_09 car_08))(not (behind-car car_09 car_09))(not (behind-car car_09 car_10))(not (behind-car car_09 car_11))(not (behind-car car_10 car_00))(not (behind-car car_10 car_01))(not (behind-car car_10 car_02))(not (behind-car car_10 car_04))(not (behind-car car_10 car_05))(not (behind-car car_10 car_06))(not (behind-car car_10 car_07))(not (behind-car car_10 car_08))(not (behind-car car_10 car_09))(not (behind-car car_10 car_10))(not (behind-car car_10 car_11))(not (behind-car car_11 car_00))(not (behind-car car_11 car_01))(not (behind-car car_11 car_02))(not (behind-car car_11 car_03))(not (behind-car car_11 car_05))(not (behind-car car_11 car_06))(not (behind-car car_11 car_07))(not (behind-car car_11 car_08))(not (behind-car car_11 car_09))(not (behind-car car_11 car_10))(not (behind-car car_11 car_11))(not (car-clear car_00))(not (car-clear car_01))(not (car-clear car_02))(not (car-clear car_03))(not (car-clear car_04))(not (curb-clear curb_0))(not (curb-clear curb_1))(not (curb-clear curb_2))(not (curb-clear curb_3))(not (curb-clear curb_4))(not (curb-clear curb_5))(not (curb-clear curb_6)))))

; plan
1. (move-car-to-car car_11 car_08 car_06)
   deleted: (car-clear car_06) (behind-car car_11 car_08)
   added: (car-clear car_08) (behind-car car_11 car_06)
   goals met: 249 of 259
2. (move-curb-to-car car_08 curb_4 car_05)
   deleted: (car-clear car_05) (at-curb-num car_08 curb_4) (at-curb car_08)
   added: (curb-clear curb_4) (behind-car car_08 car_05)
   goals met: 248 of 259
3. (move-car-to-curb car_04 car_01 curb_4)
   deleted: (curb-clear curb_4) (behind-car car_04 car_01)
   added: (car-clear car_01) (at-curb-num car_04 curb_4) (at-curb car_04)
   goals met: 251 of 259
4. (move-car-to-car car_08 car_05 car_01)
   deleted: (car-clear car_01) (behind-car car_08 car_05)
   added: (car-clear car_05) (behind-car car_08 car_01)
   goals met: 255 of 259
5. (move-car-to-car car_11 car_06 car_04)
   deleted: (car-clear car_04) (behind-car car_11 car_06)
   added: (car-clear car_06) (behind-car car_11 car_04)
   goals met: 259 of 259
